-- MySQL dump 10.13  Distrib 8.0.13, for Win64 (x86_64)
--
-- Host: localhost    Database: u
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) DEFAULT NULL,
  `pwd` varchar(100) DEFAULT NULL,
  `type` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

LOCK TABLES `admin` WRITE;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` VALUES (4,'刃舞','1','super'),(6,'123','123','shoper');
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cz`
--

DROP TABLE IF EXISTS `cz`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `cz` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(60) DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  `cz` char(30) DEFAULT NULL,
  `ip` char(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=168 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cz`
--

LOCK TABLES `cz` WRITE;
/*!40000 ALTER TABLE `cz` DISABLE KEYS */;
INSERT INTO `cz` VALUES (1,'刃舞','2019-08-15 23:17:25','slook','127.0.0.1'),(2,'刃舞','2019-08-15 23:17:26','slook','127.0.0.1'),(3,'刃舞','2019-08-15 23:17:26','slook','127.0.0.1'),(4,'刃舞','2019-08-15 23:17:26','slook','127.0.0.1'),(5,'刃舞','2019-08-15 23:17:27','slook','127.0.0.1'),(6,'刃舞','2019-08-15 23:17:27','dlook','127.0.0.1'),(7,'刃舞','2019-08-15 23:17:27','dlook','127.0.0.1'),(8,'刃舞','2019-08-15 23:19:10','slook','127.0.0.1'),(9,'刃舞','2019-08-15 23:19:11','slook','127.0.0.1'),(10,'刃舞','2019-08-15 23:19:11','slook','127.0.0.1'),(11,'刃舞','2019-08-15 23:19:11','slook','127.0.0.1'),(12,'刃舞','2019-08-15 23:19:11','slook','127.0.0.1'),(13,'刃舞','2019-08-15 23:19:11','dlook','127.0.0.1'),(14,'刃舞','2019-08-15 23:19:12','dlook','127.0.0.1'),(15,'刃舞','2019-08-15 23:20:46','slook','127.0.0.1'),(16,'刃舞','2019-08-15 23:20:46','slook','127.0.0.1'),(17,'刃舞','2019-08-15 23:20:47','slook','127.0.0.1'),(18,'刃舞','2019-08-15 23:20:47','slook','127.0.0.1'),(19,'刃舞','2019-08-15 23:20:47','slook','127.0.0.1'),(20,'刃舞','2019-08-15 23:20:47','dlook','127.0.0.1'),(21,'刃舞','2019-08-15 23:20:47','dlook','127.0.0.1'),(22,'刃舞','2019-08-15 23:31:03','slook','127.0.0.1'),(23,'刃舞','2019-08-15 23:31:04','slook','127.0.0.1'),(24,'刃舞','2019-08-15 23:31:04','slook','127.0.0.1'),(25,'刃舞','2019-08-15 23:31:05','slook','127.0.0.1'),(26,'刃舞','2019-08-15 23:31:05','slook','127.0.0.1'),(27,'刃舞','2019-08-15 23:31:05','dlook','127.0.0.1'),(28,'刃舞','2019-08-15 23:31:06','dlook','127.0.0.1'),(29,'刃舞','2019-08-15 23:32:23','slook','127.0.0.1'),(30,'刃舞','2019-08-15 23:32:24','slook','127.0.0.1'),(31,'刃舞','2019-08-15 23:32:25','slook','127.0.0.1'),(32,'刃舞','2019-08-15 23:32:25','slook','127.0.0.1'),(33,'刃舞','2019-08-15 23:32:25','slook','127.0.0.1'),(34,'刃舞','2019-08-15 23:32:26','dlook','127.0.0.1'),(35,'刃舞','2019-08-15 23:32:27','dlook','127.0.0.1'),(36,'刃舞','2019-08-15 23:47:20','slook','127.0.0.1'),(37,'刃舞','2019-08-15 23:47:20','dlook','127.0.0.1'),(38,'刃舞','2019-08-15 23:47:20','slook','127.0.0.1'),(39,'刃舞','2019-08-15 23:47:20','slook','127.0.0.1'),(40,'刃舞','2019-08-15 23:47:20','slook','127.0.0.1'),(41,'刃舞','2019-08-15 23:47:21','slook','127.0.0.1'),(42,'刃舞','2019-08-15 23:47:21','dlook','127.0.0.1'),(43,'刃舞','2019-08-15 23:52:48','slook','127.0.0.1'),(44,'刃舞','2019-08-15 23:52:48','slook','127.0.0.1'),(45,'刃舞','2019-08-15 23:52:49','slook','127.0.0.1'),(46,'刃舞','2019-08-15 23:52:49','slook','127.0.0.1'),(47,'刃舞','2019-08-15 23:52:49','slook','127.0.0.1'),(48,'刃舞','2019-08-15 23:52:49','dlook','127.0.0.1'),(49,'刃舞','2019-08-15 23:52:50','dlook','127.0.0.1'),(50,'刃舞','2019-08-15 23:53:24','slook','127.0.0.1'),(51,'刃舞','2019-08-15 23:53:26','slook','127.0.0.1'),(52,'刃舞','2019-08-15 23:53:26','slook','127.0.0.1'),(53,'刃舞','2019-08-15 23:53:26','slook','127.0.0.1'),(54,'刃舞','2019-08-15 23:53:26','slook','127.0.0.1'),(55,'刃舞','2019-08-15 23:53:27','dlook','127.0.0.1'),(56,'刃舞','2019-08-15 23:53:27','dlook','127.0.0.1'),(57,'刃舞','2019-08-15 23:53:31','slook','127.0.0.1'),(58,'刃舞','2019-08-15 23:53:32','slook','127.0.0.1'),(59,'刃舞','2019-08-15 23:53:32','slook','127.0.0.1'),(60,'刃舞','2019-08-15 23:53:32','slook','127.0.0.1'),(61,'刃舞','2019-08-15 23:53:33','slook','127.0.0.1'),(62,'刃舞','2019-08-15 23:53:33','dlook','127.0.0.1'),(63,'刃舞','2019-08-15 23:53:33','dlook','127.0.0.1'),(64,'刃舞','2019-08-15 23:54:09','slook','127.0.0.1'),(65,'刃舞','2019-08-15 23:54:09','slook','127.0.0.1'),(66,'刃舞','2019-08-15 23:54:10','slook','127.0.0.1'),(67,'刃舞','2019-08-15 23:54:10','slook','127.0.0.1'),(68,'刃舞','2019-08-15 23:54:10','slook','127.0.0.1'),(69,'刃舞','2019-08-15 23:54:11','dlook','127.0.0.1'),(70,'刃舞','2019-08-15 23:54:11','dlook','127.0.0.1'),(71,'刃舞','2019-08-15 23:54:53','slook','127.0.0.1'),(72,'刃舞','2019-08-15 23:54:53','slook','127.0.0.1'),(73,'刃舞','2019-08-15 23:54:53','slook','127.0.0.1'),(74,'刃舞','2019-08-15 23:54:54','slook','127.0.0.1'),(75,'刃舞','2019-08-15 23:54:54','slook','127.0.0.1'),(76,'刃舞','2019-08-15 23:54:54','dlook','127.0.0.1'),(77,'刃舞','2019-08-15 23:54:54','dlook','127.0.0.1'),(78,'刃舞','2019-08-15 23:55:19','slook','127.0.0.1'),(79,'刃舞','2019-08-15 23:55:20','slook','127.0.0.1'),(80,'刃舞','2019-08-15 23:55:20','slook','127.0.0.1'),(81,'刃舞','2019-08-15 23:55:20','slook','127.0.0.1'),(82,'刃舞','2019-08-15 23:55:20','slook','127.0.0.1'),(83,'刃舞','2019-08-15 23:55:21','dlook','127.0.0.1'),(84,'刃舞','2019-08-15 23:55:21','dlook','127.0.0.1'),(85,'刃舞','2019-08-15 23:55:24','slook','127.0.0.1'),(86,'刃舞','2019-08-15 23:55:24','slook','127.0.0.1'),(87,'刃舞','2019-08-15 23:55:24','slook','127.0.0.1'),(88,'刃舞','2019-08-15 23:55:25','slook','127.0.0.1'),(89,'刃舞','2019-08-15 23:55:25','slook','127.0.0.1'),(90,'刃舞','2019-08-15 23:55:25','dlook','127.0.0.1'),(91,'刃舞','2019-08-15 23:55:25','dlook','127.0.0.1'),(92,'刃舞','2019-08-15 23:58:10','slook','127.0.0.1'),(93,'刃舞','2019-08-15 23:58:10','slook','127.0.0.1'),(94,'刃舞','2019-08-15 23:58:11','slook','127.0.0.1'),(95,'刃舞','2019-08-15 23:58:11','slook','127.0.0.1'),(96,'刃舞','2019-08-15 23:58:11','slook','127.0.0.1'),(97,'刃舞','2019-08-15 23:58:12','dlook','127.0.0.1'),(98,'刃舞','2019-08-15 23:58:12','dlook','127.0.0.1'),(99,'刃舞','2019-08-15 23:58:20','slook','127.0.0.1'),(100,'刃舞','2019-08-15 23:58:20','slook','127.0.0.1'),(101,'刃舞','2019-08-15 23:58:20','slook','127.0.0.1'),(102,'刃舞','2019-08-15 23:58:21','slook','127.0.0.1'),(103,'刃舞','2019-08-15 23:58:21','slook','127.0.0.1'),(104,'刃舞','2019-08-15 23:58:21','dlook','127.0.0.1'),(105,'刃舞','2019-08-15 23:58:22','dlook','127.0.0.1'),(106,'刃舞','2019-08-15 23:58:32','dcud','127.0.0.1'),(107,'刃舞','2019-08-16 00:48:18','slook','127.0.0.1'),(108,'刃舞','2019-08-16 00:48:19','slook','127.0.0.1'),(109,'刃舞','2019-08-16 00:48:19','slook','127.0.0.1'),(110,'刃舞','2019-08-16 00:48:20','slook','127.0.0.1'),(111,'刃舞','2019-08-16 00:48:20','slook','127.0.0.1'),(112,'刃舞','2019-08-16 00:48:20','dlook','127.0.0.1'),(113,'刃舞','2019-08-16 00:48:21','dlook','127.0.0.1'),(114,'刃舞','2019-08-16 00:48:27','slook','127.0.0.1'),(115,'刃舞','2019-08-16 00:48:27','slook','127.0.0.1'),(116,'刃舞','2019-08-16 00:48:28','slook','127.0.0.1'),(117,'刃舞','2019-08-16 00:48:28','slook','127.0.0.1'),(118,'刃舞','2019-08-16 00:48:28','slook','127.0.0.1'),(119,'刃舞','2019-08-16 00:48:29','dlook','127.0.0.1'),(120,'刃舞','2019-08-16 00:48:29','dlook','127.0.0.1'),(121,'刃舞','2019-08-16 00:49:44','slook','127.0.0.1'),(122,'刃舞','2019-08-16 00:49:44','slook','127.0.0.1'),(123,'刃舞','2019-08-16 00:49:45','slook','127.0.0.1'),(124,'刃舞','2019-08-16 00:49:45','slook','127.0.0.1'),(125,'刃舞','2019-08-16 00:49:45','slook','127.0.0.1'),(126,'刃舞','2019-08-16 00:49:46','dlook','127.0.0.1'),(127,'刃舞','2019-08-16 00:49:46','dlook','127.0.0.1'),(128,'刃舞','2019-08-16 00:50:59','slook','127.0.0.1'),(129,'刃舞','2019-08-16 00:50:59','slook','127.0.0.1'),(130,'刃舞','2019-08-16 00:50:59','slook','127.0.0.1'),(131,'刃舞','2019-08-16 00:51:00','slook','127.0.0.1'),(132,'刃舞','2019-08-16 00:51:00','slook','127.0.0.1'),(133,'刃舞','2019-08-16 00:51:00','dlook','127.0.0.1'),(134,'刃舞','2019-08-16 00:51:00','dlook','127.0.0.1'),(135,'刃舞','2019-08-16 00:51:37','slook','127.0.0.1'),(136,'刃舞','2019-08-16 00:51:38','slook','127.0.0.1'),(137,'刃舞','2019-08-16 00:51:38','slook','127.0.0.1'),(138,'刃舞','2019-08-16 00:51:39','slook','127.0.0.1'),(139,'刃舞','2019-08-16 00:51:39','slook','127.0.0.1'),(140,'刃舞','2019-08-16 00:51:40','dlook','127.0.0.1'),(141,'刃舞','2019-08-16 00:51:40','dlook','127.0.0.1'),(142,'刃舞','2019-08-16 00:54:32','slook','127.0.0.1'),(143,'刃舞','2019-08-16 00:54:33','slook','127.0.0.1'),(144,'刃舞','2019-08-16 00:54:33','slook','127.0.0.1'),(145,'刃舞','2019-08-16 00:54:34','slook','127.0.0.1'),(146,'刃舞','2019-08-16 00:54:35','slook','127.0.0.1'),(147,'刃舞','2019-08-16 00:54:36','dlook','127.0.0.1'),(148,'刃舞','2019-08-16 00:54:36','dlook','127.0.0.1'),(149,'刃舞','2019-08-16 01:14:21','slook','127.0.0.1'),(150,'刃舞','2019-08-16 01:14:22','slook','127.0.0.1'),(151,'刃舞','2019-08-16 01:14:22','slook','127.0.0.1'),(152,'刃舞','2019-08-16 01:14:22','slook','127.0.0.1'),(153,'刃舞','2019-08-16 01:14:22','slook','127.0.0.1'),(154,'刃舞','2019-08-16 01:14:23','dlook','127.0.0.1'),(155,'刃舞','2019-08-16 01:14:23','dlook','127.0.0.1'),(156,'刃舞','2019-08-16 01:14:43','cduser','127.0.0.1'),(157,'刃舞','2019-08-16 01:14:43','cduser','127.0.0.1'),(158,'刃舞','2019-08-16 01:14:43','cduser','127.0.0.1'),(159,'刃舞','2019-08-16 01:14:44','cdsuper','127.0.0.1'),(160,'刃舞','2019-08-16 01:14:45','cduser','127.0.0.1'),(161,'刃舞','2019-08-16 01:14:45','cdsuper','127.0.0.1'),(162,'刃舞','2019-08-16 01:14:47','cduser','127.0.0.1'),(163,'刃舞','2019-08-16 01:14:47','cduser','127.0.0.1'),(164,'刃舞','2019-08-16 01:14:47','cduser','127.0.0.1'),(165,'刃舞','2019-08-16 01:14:47','cdsuper','127.0.0.1'),(166,'刃舞','2019-08-16 01:14:53','cduser','127.0.0.1'),(167,'刃舞','2019-08-16 01:14:53','cdsuper','127.0.0.1');
/*!40000 ALTER TABLE `cz` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `g13`
--

DROP TABLE IF EXISTS `g13`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `g13` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sid` int(11) DEFAULT NULL,
  `name` varchar(300) DEFAULT NULL,
  `ms` varchar(600) DEFAULT NULL,
  `count` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `g13`
--

LOCK TABLES `g13` WRITE;
/*!40000 ALTER TABLE `g13` DISABLE KEYS */;
INSERT INTO `g13` VALUES (21,124,'TS眼镜架 米家定制','{\"yjkxz\":\"u65b9u6846\",\"price\":\"249\"}',1),(22,128,'自动折叠伞','{\"price\":\"99\"}',1);
/*!40000 ALTER TABLE `g13` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `login`
--

DROP TABLE IF EXISTS `login`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `login` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(60) DEFAULT NULL,
  `time` datetime DEFAULT NULL,
  `ip` char(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `login`
--

LOCK TABLES `login` WRITE;
/*!40000 ALTER TABLE `login` DISABLE KEYS */;
INSERT INTO `login` VALUES (1,'刃舞','2019-08-12 20:31:47','127.0.0.1'),(2,'刃舞','2019-08-12 21:19:11','127.0.0.1'),(3,'刃舞','2019-08-12 22:43:47','127.0.0.1'),(4,'刃舞','2019-08-12 22:48:19','127.0.0.1'),(5,'刃舞','2019-08-12 22:53:28','127.0.0.1'),(6,'刃舞','2019-08-14 21:22:47','127.0.0.1'),(7,'刃舞','2019-08-14 22:39:39','127.0.0.1'),(8,'刃舞','2019-08-14 22:56:44','127.0.0.1'),(9,'刃舞','2019-08-14 23:04:01','127.0.0.1'),(10,'刃舞','2019-08-14 23:06:43','127.0.0.1'),(11,'刃舞','2019-08-14 23:10:09','127.0.0.1'),(12,'刃舞','2019-08-15 12:09:03','127.0.0.1'),(13,'刃舞','2019-08-15 16:45:49','127.0.0.1'),(14,'刃舞','2019-08-15 19:58:32','127.0.0.1'),(15,'刃舞','2019-08-15 21:12:00','127.0.0.1'),(16,'刃舞','2019-08-15 23:58:15','127.0.0.1'),(17,'刃舞','2019-08-16 00:48:23','127.0.0.1');
/*!40000 ALTER TABLE `login` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) DEFAULT NULL,
  `pwd` varchar(100) DEFAULT NULL,
  `mail` char(30) DEFAULT NULL,
  `adrs` text,
  `phone` char(20) DEFAULT NULL,
  `sex` char(8) DEFAULT NULL,
  `head` text,
  `time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (13,'刃舞','123','123456789@qq.com','中国','123456789','男','\\static\\iva\\user_13_head_cs.jpg','2019-07-24 20:59:39'),(14,'未命名','123','12345678910@qq.com','待设置','待设置','待设置','\\static\\iva\\head.jpg','2019-08-14 23:11:14'),(15,'未命名','123','987654321@qq.com','待设置','待设置','待设置','\\static\\iva\\head.jpg','2019-08-14 23:18:38');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-08-16  1:17:45
